#+TITLE: DM2 Final Assignment 
#+LANGUAGE: en
#+OPTIONS: H:4 num:nil toc:nil \n:nil @:t ::t |:t ^:t *:t TeX:t LaTeX:t
#+OPTIONS: html-postamble:nil
#+STARTUP: showeverything entitiespretty
#+SETUPFILE: theme-bigblow.setup
 
[[elisp:(find-file-other-window%20"generic-instructions.org")][Read Instructions]]
[[elisp:(progn%20(save-buffer)%20(browse-url-of-file%20(org-html-export-to-html)))][Export to HTML and Browse]]
[[elisp:(progn%20(save-buffer)%20(org-clock-report%201)%20(save-buffer))][Insert/Update Clock Summary Report]]
* DONE What Is True?
  CLOSED: [2018-12-17 Mon 17:50]
  This is a tool that allows you to assess yourself on how you did
  with this assignment. Change false to true if warranted. 

#+BEGIN_SRC elisp :results silent :tangle wit.el
  (defun what-is-true-about-my-engagement-with-this-final-assignment ()
      (vector
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; What is true of my experience in general?                              ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    "I had fun. (2 points)" true
    "I learned something new. (2 points)" true
    "I achieved something meaningful, or something I can build upon at a later time. (3 points)" true

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; What is true of my report on what I learned?                            ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    "I responded with several (> 50) well-written sentences to Brother Bessey's essay. (4 points)" false
    "I reported what I thought about the essay in general. (5 points)" true
    "I reported what I thought about the certainty-not-chance feature of the `pigeonhole principle. (6 points)" true
    "I reported what I thought about the philosophical aspect of the pigeonhole principle per page 41. (7 points)" true
    "I reported on how my discussion with a non-STEM non-classmate went. (8 points)" true
    "I reported on how I grappled with the problem at the bottom of page 40. (9 points)" true
    "I reported on the connection I found between the pigeonhole principle and lossless data compression. (10 points)" true
 
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; What is true of the mechanical "infelicities" (misspelled words,        ;;
    ;; grammatical errors, punctuation errors) in my report of what I learned? ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    "There are fewer than four. (4 points)" true
    "There are fewer than three. (4 points)" true
    "There are fewer than two. (4 points)" true
    "There are none. (4 points)" true

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; How well did I implement the function				                           ;;
    ;; calculate-number-of-possible-initials-including-middle-initial-if-any?  ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    "I implemented the function in 3 or fewer lines of code. (4 points)" true
    "I used either the sum rule and product rule together or else just the product rule. (4 points)" true
    "The function calculates and returns the correct value (see Problem QFK). (4 points)" true

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; How well did I implement the pigeonhole-from-pigeon function?           ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    "The function parses a string like \"John Doe: LDS LikesCats BornBefore NoWearsContacts NoBitesFingernails LivesClose\" and returns the string \"J_D111001\". (4 points)" true
    "The function calls (calculate-number-of-possible-initials-including-middle-initial-if-any 26) and uses the result. (4 points)" true
    "The function has an assert that the length of the string being returned is 9. (4 points)" true
    "The cardinality of the codomain (set of possible return values) of this function is over a million. (4 points)" true
  ))
#+END_SRC

#+BEGIN_SRC elisp
  (setq points-in-general (+ 2 2 3) 
        points-for-report (+ 4 5 6 7 8 9 10)
        points-for-absence-of-MIs (+ 4 4 4 4)
        points-for-1st-function (+ 4 4 4) 
        points-for-2nd-function (+ 4 4 4 4) 
        total-points (+ points-in-general points-for-report points-for-absence-of-MIs points-for-1st-function points-for-2nd-function))
#+END_SRC

#+RESULTS:
: 100

#+BEGIN_SRC elisp
  (setq true t
        false nil
        witvec (what-is-true-about-my-engagement-with-this-final-assignment)
        assertions (loop for datum across witvec when (stringp datum) collect datum)
        points (mapcar (lambda (x) (string-to-number (substring x (+ 3 (string-match-p "\\." x))))) assertions)
        total-points (apply '+ points)
        my-responses (loop for datum across witvec unless (stringp datum) collect datum)
        my-points (mapcar* (lambda (asserted-earned points) (if asserted-earned points 0)) my-responses points)
        displayed-score (format "#+SCORE: %d\n" (apply '+ my-points)))
#+END_SRC

#+RESULTS:
: #+SCORE: 96
